

#错误码大于65535时 高16位是通道 低16位是错误码  通道 = errorCode>>16     错误信息 = errorCode - 65535     

ErrorCode =\
    {
        0:"成功",
        4097  : "时间分辨率非法值              ",
        4098  : "动态范围非法值                ",
        4099  : "采集时间非法值                ",
        4100  : "刷新时间非法值                ",
        4101  : "时钟输入非法值                ",
        4102  : "时钟输出非法值                ",
        4103  : "工作模式非法值                ",
        4104  : "时钟周期非法值                ",
        4105  : "绘图窗口非法值                ",
                                            
        4106  : "通道使能非法值                ",
        4107  : "通道触发阈值非法值            ",
        4108  : "通道延时非法值                ",
        4109  : "通道触发方式非法值            ",
                                            
        8193  : "Mark 触发阈值非法值           ",
        8194  : "MARK 最大信号周期非法值       ",
        8195  : "Mark 触发模式非法值           ",
        8196  : "Mark 保存路径非法值           ",
        8197  : "Mark 保存路径非法值           ",
                                            
        12289  : "随机数保存最大值非法值       ",
        12290  : "随机数保存路径非法值         ",
        12291  : "随机数通道非法值             ",
                                            
        16385  : "符合门必须是分辨率的整数倍   ",
        16386  : "符合门非法值                 ",
        16387  : "符合计数通道非法值           ",
                                            
        20481  : "网络错误                    ",
        20482  : "网络未连接                   ",
        20483  : "网络连接信息错误             ",
                                            
        24577  : "溢出                         ",
        24578  : "接受数据异常                 ",
        24579  : "升级文件异常                 ",
        24580  : "获取校准结果异常             ",
        24581  : "设置算法异常                 ",
        24582  : "定时采集结束，停止采集       ",
        24583  : "mark无信号                   ",

    };